УТ.УчетЗадач/src/Documents/cbr_Задача/cbr_Задача.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>cbr_Задача</name>
  <comment>Задачи сотрудников</comment>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеЗадачи</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЗадачи</name>
    <type>
      <types>CatalogRef.cbr_ВидыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Постановщик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>EnumRef.cbr_ПриоритетыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлавнаяЗадача</name>
    <type>
      <types>DocumentRef.cbr_Задача</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетВремени</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольВремени</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлавныйМенеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетКонтроляПоЗавершению</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Метка</name>
    <type>
      <types>CatalogRef.cbr_МеткиЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаЗакрытия</name>
    <type>
      <types>CatalogRef.cbr_ПричиныЗакрытияЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Наблюдатели</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЧекЛист</name>
    <attributes>
      <name>Текст</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Выполнен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Метки</name>
    <attributes>
      <name>Метка</name>
      <type>
        <types>CatalogRef.cbr_МеткиЗадач</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ.УчетЗадач/src/Enums/cbr_ПодпискаДляТриггера/cbr_ПодпискаДляТриггера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>cbr_ПодпискаДляТриггера</name>
  <enumValues>
    <name>ПроведениеДокументаЗадача</name>
  </enumValues>
  <enumValues>
    <name>ПриСозданииНаСервереФормыЗадачи</name>
  </enumValues>
  <enumValues>
    <name>КнопкаЗакрытияЗадачи</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаВопросПоЗадаче</name>
  </enumValues>
  <enumValues>
    <name>СозданиеВопросаПоЗадаче</name>
  </enumValues>
  <enumValues>
    <name>РегламентноеЗадание</name>
  </enumValues>
  <enumValues>
    <name>ОтправкаДедлайнаНаСогласование</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДедлайна</name>
  </enumValues>
  <enumValues>
    <name>ОтправкаОценкиНаСогласование</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеОценки</name>
  </enumValues>
  <enumValues>
    <name>КнопкаВзятьЗадачу</name>
  </enumValues>
  <enumValues>
    <name>КнопкаВзятьЗадачуСебе</name>
  </enumValues>
  <enumValues>
    <name>ПослеЗаписиНаСервереФормаЗадачи</name>
  </enumValues>
</mdclass:Enum>

УТ.УчетЗадач/src/Documents/cbr_Задача/Forms/ФормаЗакрытияЗадачи/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗадачаПараметр = Неопределено;
	Если Параметры.Свойство("Задача", ЗадачаПараметр) Тогда
		Задача = ЗадачаПараметр;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ОтменаЗакрытия(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьЗакрыть(Команда)
	ЗаписатьЗакрытьНаСервере();
	Закрыть();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ЗаписатьЗакрытьНаСервере()
	Док = Задача.ПолучитьОбъект();
	Док.ПричинаЗакрытия = Причина;
	Док.Записать(РежимЗаписиДокумента.Проведение);

	Подписка = ПредопределенноеЗначение(
		"Перечисление.cbr_ПодпискаДляТриггера.КнопкаЗакрытияЗадачи");
	cbr_ОбработкаТриггеровВызовСервера.ВызовТриггера(Подписка, Задача);

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	cbr_Задача.Дата,
	|	cbr_Задача.Наименование,
	|	cbr_Задача.ВидЗадачи,
	|	cbr_Задача.Постановщик,
	|	cbr_Задача.ГлавныйМенеджер,
	|	cbr_Задача.ТребуетКонтроляПоЗавершению
	|ИЗ
	|	Документ.cbr_Задача КАК cbr_Задача
	|ГДЕ
	|	cbr_Задача.Ссылка = &Задача";

	Запрос.УстановитьПараметр("Задача", Задача);

	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();

	Если Выборка.Следующий() Тогда
		Если Выборка.ТребуетКонтроляПоЗавершению Тогда
			ПодчиненнаяЗадача = Документы.cbr_Задача.СоздатьДокумент();
			ПодчиненнаяЗадача.Дата = ТекущаяДатаСеанса();
			ПодчиненнаяЗадача.Наименование = "Поверка задачи " + Выборка.Наименование + " от " + Формат(Выборка.Дата,
				"ДФ=dd.MM.yyyy");
			ПодчиненнаяЗадача.ВидЗадачи = Выборка.ВидЗадачи;
			ПодчиненнаяЗадача.Постановщик = Выборка.Постановщик;
			ПодчиненнаяЗадача.ГлавнаяЗадача = Задача;
			ПодчиненнаяЗадача.Автор = Пользователи.АвторизованныйПользователь();
			ПодчиненнаяЗадача.Записать(РежимЗаписиДокумента.Проведение);

			Если ТипЗнч(Выборка.Постановщик) = Тип("СправочникСсылка.Партнеры") Тогда
				Исполнитель = Выборка.ГлавныйМенеджер;
			Иначе
				Исполнитель = Выборка.Постановщик;
			КонецЕсли;

			cbr_ДвиженияПоРегистрам.ДвижениеИсполнителиЗадач(Задача, Исполнитель);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
